app/controllers/api/pins_controller.rb

  def create
    @pin = Pin.new(pin_params)
    @pin.author_id = current_user.id
    if @pin.save
---
INSERT INTO "pins" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "adfa"], ["author_id", 1], ["created_at", "2021-11-30 07:46:46.388969"], ["updated_at", "2021-11-30 07:46:46.388969"]]

  def update
    @pin = Pin.find(params[:id])

    if current_user.id == @pin.author_id && @pin.update(pin_params)
      @pins = Pin.all
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "pins" SET "description" = $1, "updated_at" = $2 WHERE "pins"."id" = $3  [["description", "Nails: for anything and everything to do with nails and nail care!s"], ["updated_at", "2021-12-01 18:40:47.695160"], ["id", 1]]
SELECT "pins".* FROM "pins"

  def destroy
    @pin = Pin.find(params[:id])
    if @pin.destroy
      @pins = Pin.all
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "pins" WHERE "pins"."id" = $1  [["id", 4]]
SELECT "pins".* FROM "pins"