app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "rwnW7S14UQsPxk4lMGmOeA"], ["updated_at", "2021-11-20 08:36:42.994243"], ["id", 9]]
---
  def reset_session_token!
    # When a user logs out, we want to scramble their session_token so that bad people cannot use the old one
    self.session_token = SecureRandom.urlsafe_base64
    self.save